ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_hsm_error_aggregator_config_regs.xml
<module id="HSM_ERROR_AGGREGATOR_CONFIG_REGS" HW_revision="" description="HSM ERROR AGGREGATOR CONFIG Registers">
	<register id="HSM_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="High Priority Error address register">
		<bitfield id="HSM_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Low Priority Error address register">
		<bitfield id="HSM_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_ERROR_TYPE" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ACC_TYPE_READ" description="Access type Read" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ACC_TYPE_WRITE" description="Access type write" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="High Priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="HSM_ERROR_TYPE_FRC" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TYPE_READ" description="Access type Read force" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TYPE_WRITE" description="Access type write force" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="Force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_ERROR_TYPE_CLR" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TYPE_READ" description="Access type Read clear" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TYPE_WRITE" description="Access type write clear" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
</module>
